Revit 2027 API
ViewExportingEventArgs.ViewId Property
 Identifies the view about to be exported.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ViewId { get; }
Public ReadOnly Property ViewId As ElementId
	Get
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
member ViewId : ElementId with get
Property Value
ElementId
See Also
Reference
ViewExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace